;-------------------------------------------------------------------------------------------
; Common Abilities
;-------------------------------------------------------------------------------------------

[Beags_Escalation_LightningReflexes X2AbilityTemplate]
LocFriendlyName="Lightning Reflexes"
LocLongDescription="The hit chance of reaction fire against this unit is reduced by 90 percent for the first shot, and by 70 percent for additional shots."
LocHelpText="The hit chance of reaction fire against this unit is reduced by 90 percent for the first shot, and by 70 percent for additional shots."
LocFlyOverText="Lightning Reflexes"
LocPromotionPopupText="The hit chance of reaction fire against this unit is reduced by 90 percent for the first shot, and by 70 percent for additional shots."

[Beags_Escalation_Opportunist X2AbilityTemplate]
LocFriendlyName="Opportunist"
LocLongDescription="Eliminates the Aim penalty on reaction shots, and allows reaction shots to cause critical hits."
LocHelpText="Eliminates the Aim penalty on reaction shots, and allows reaction shots to cause critical hits."
LocFlyOverText="Opportunist"
LocPromotionPopupText="<Bullet/> Eliminates the Aim penalty on reaction shots, and allows reaction shots to cause critical hits.<br/>"

[Beags_Escalation_SwordSliceNoCharge X2AbilityTemplate]
LocFriendlyName="Slash"
LocLongDescription="Attack any enemy within movement range with your sword."
LocHelpText="Attack any enemy within movement range with your sword."
LocFlyOverText="Slash"
LocPromotionPopupText="<Bullet/> You can trigger the Slash ability by placing the movement cursor over an enemy.<br/><Bullet/> You can only use a single action to move and trigger a Slash against an adjacent enemy.<br/>"

[Beags_Escalation_PistolStandardShot X2AbilityTemplate]
LocFriendlyName="Fire Pistol"
LocLongDescription="You have been trained to effectively utilize the full flexibility of a pistol as a complement to your sniper rifle."
LocHelpText="Fire your pistol at a target."
LocFlyOverText=""

[Beags_Escalation_PistolOverwatch X2AbilityTemplate]
LocFriendlyName="Pistol Overwatch"
LocHelpText="Use your pistol to fire on the first enemy that moves within your line of sight, with a penalty to aim."
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight, but only if revealed."
LocFlyOverText="Pistol Overwatch"
LocFriendlyNameWhenConcealed="Pistol Overwatch (Concealed)"

[Beags_Escalation_Executioner X2AbilityTemplate]
LocFriendlyName="Executioner"
LocLongDescription="Confers +10 aim and +10 critical chance against targets at or below 50% health."
LocHelpText="Confers +10 aim and +10 critical chance against targets at or below 50% health."
LocFlyOverText="Executioner"
LocPromotionPopupText="Confers +10 aim and +10 critical chance against targets at or below 50% health."

[Beags_Escalation_Stealth X2AbilityTemplate]
LocFriendlyName="Conceal"
LocLongDescription="When the squad is revealed, this soldier remains concealed. Once per mission, immediately enter concealment."
LocHelpText="When the squad is revealed, this soldier remains concealed. Once per mission, immediately enter concealment."
LocFlyOverText="Conceal"
LocPromotionPopupText="<Bullet/> Even if the squad does not start a mission concealed, soldiers with Conceal will still begin the mission with concealment.<br/><Bullet/> If the soldier is the one that breaks squad concealment, then Conceal does not apply.<br/><Bullet/> Concealment can be entered at any location once per mission, but when done inside the detection radii of nearby enemies the Ranger will be revealed when flanked.<br/>"

[Beags_Escalation_LightningHandsPistol X2AbilityTemplate]
LocFriendlyName="Lightning Hands"
LocLongDescription="Fire your pistol at a target. This attack does not cost an action."
LocHelpText="Fire your pistol at a target. This attack does not cost an action."
LocFlyOverText="Lightning Hands"
LocPromotionPopupText="<Bullet/> 4 turn cooldown.<br/>"

[Beags_Escalation_LightningHandsSword X2AbilityTemplate]
LocFriendlyName="Lightning Hands"
LocLongDescription="Slash your sword at a target. This attack does not cost an action."
LocHelpText="Slash your sword at a target. This attack does not cost an action."
LocFlyOverText="Lightning Hands"
LocPromotionPopupText="<Bullet/> 4 turn cooldown.<br/>"

[Beags_Escalation_Flush X2AbilityTemplate]
LocFriendlyName="Flush"
LocLongDescription="Fire a shot that encourages enemies to move. The shot is easy to hit with (+30 aim), but does reduced damage (-50% base weapon damage). Uses 2 ammo."
LocHelpText="Fire a shot that encourages enemies to move. +30 aim. -50% base weapon damage. Uses 2 ammo."
LocFlyOverText="Flush"
LocPromotionPopupText="<Bullet/> +30 aim.<br/><Bullet/> -50% base weapon damage.<br/><Bullet/> Costs 2 ammo.<br/><Bullet/> Causes enemies to move.<br/>"

[Beags_Escalation_HitAndRun X2AbilityTemplate]
LocFriendlyName="Hit and Run"
LocLongDescription="Your first attack of each turn against an uncovered or flanked target does not cost an action."
LocHelpText="Your first attack of each turn against an uncovered or flanked target does not cost an action."
LocFlyOverText="Hit and Run"
LocPromotionPopupText="<Bullet/> Your first attack of each turn against an uncovered or flanked target does not cost an action.<br/>"

[Beags_Escalation_SmokeAndMirrors X2AbilityTemplate]
LocFriendlyName="Smoke and Mirrors"
LocLongDescription="Allows one additional use of all equipped support grenades during each mission. It also increases charges from Smoke Grenade and Battle Scanner perks by 1."
LocHelpText="Allows one additional use of all equipped support grenades during each mission. It also increases charges from Smoke Grenade and Battle Scanner perks by 1."
LocFlyOverText="Smoke and Mirrors"
LocPromotionPopupText="<Bullet/> Allows one additional use of all equipped support grenades during each mission.<br/><Bullet/> Increases charges from Smoke Grenade and Battle Scanner perks by 1.<br/>"

[Beags_Escalation_Reaper X2AbilityTemplate]
LocFriendlyName="Reaper"
LocLongDescription="Your kills with a sword or pistol refund your action points for the turn."
LocHelpText="Your kills with a sword or pistol refund your action points for the turn."
LocFlyOverText="Reaper"
LocPromotionPopupText="<Bullet/> Your kills with a sword or pistol refund your action points for the turn.<br/>"

[Beags_Escalation_RapidReaction X2AbilityTemplate]
LocFriendlyName="Rapid Reaction"
LocLongDescription="If on Overwatch, confers a bonus reaction shot (to a maximum three shots total) for every reaction shot that is a hit."
LocHelpText="If on Overwatch, confers a bonus reaction shot (to a maximum three shots total) for every reaction shot that is a hit."
LocFlyOverText="Rapid Reaction"
LocPromotionPopupText="<Bullet/> If on Overwatch, confers a bonus reaction shot (to a maximum three shots total) for every reaction shot that is a hit.<br/>"

[Beags_Escalation_ReadyForAnything X2AbilityTemplate]
LocFriendlyName="Ready for Anything"
LocLongDescription="If you fire without taking any other costly action, you automatically enter Overwatch at the end of your turn."
LocHelpText="If you fire without taking any other costly action, you automatically enter Overwatch at the end of your turn."
LocFlyOverText="Ready for Anything"
LocPromotionPopupText="<Bullet/> If you fire without taking any other costly action, you automatically enter Overwatch at the end of your turn.<br/>"

[Beags_Escalation_DangerZone X2AbilityTemplate]
LocFriendlyName="Danger Zone"
LocLongDescription="Increases area of effect of Suppression, Flush and explosives."
LocHelpText="Increases area of effect of Suppression, Flush and explosives"
LocFlyOverText="Danger Zone"
LocPromotionPopupText="<Bullet/> +2 explosive radius.<br/><Bullet/> +3 Suppression and Flush radius.<br/>"

[Beags_Escalation_DangerZoneSuppression X2AbilityTemplate]
LocFriendlyName="Suppression"
LocLongDescription="Fire a barrage that pins down targets in an area, granting reaction fire against them if they move, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to the targets' aim."
LocHelpText="Penalize targets' aim and shoot them if they move."
LocFlyOverText="Suppression"
LocPromotionPopupText="<Bullet/> Suppression costs <Ability:SelfAmmoCost/> ammo points to use, but has no cooldown.<br/><Bullet/> Suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/>"

[Beags_Escalation_DangerZoneFlush X2AbilityTemplate]
LocFriendlyName="Flush"
LocLongDescription="Fire a barrage that pins down targets in an area, encouraging them to move. The ability is easy to hit with (+30 aim), but does reduced damage (-50% base weapon damage). Uses 2 ammo."
LocHelpText="Fire a barrage that pins down targets in an area, encouraging them to move. The ability is easy to hit with (+30 aim), but does reduced damage (-50% base weapon damage). Uses 2 ammo."
LocFlyOverText="Flush"
LocPromotionPopupText="<Bullet/> +30 aim.<br/><Bullet/> -50% base weapon damage.<br/><Bullet/> Costs 2 ammo.<br/><Bullet/> Causes enemies to move.<br/>"

[Beags_Escalation_DoubleTap X2AbilityTemplate]
LocFriendlyName="Double Tap"
LocLongDescription="Allows you to perform an extra attack if you remain stationary for the turn. Does not include the use of grenades or rockets."
LocHelpText="Allows you to perform an extra attack if you remain stationary for the turn. Does not include the use of grenades or rockets."
LocFlyOverText="Double Tap"
LocPromotionPopupText="<Bullet/> Allows you to perform an extra attack if you remain stationary for the turn.<br/><Bullet/> Does not include the use of grenades or rockets.<br/><Bullet/> 2 turn cooldown.<br/>"

;-------------------------------------------------------------------------------------------
; Scout Abilities
;-------------------------------------------------------------------------------------------

[Beags_Escalation_Scout X2SoldierClassTemplate]
DisplayName="Scout"
ClassSummary="The Scout is a nimble yet powerful soldier who operates on the front lines. The Scout does reconnaissance and close-in combat work while relying on their skills at stealth and evasion for protection."
LeftAbilityTreeTitle="Pathfinder"
RightAbilityTreeTitle="Guerilla"

RandomNickNames[0]="Apache"
RandomNickNames[1]="Cherokee"
RandomNickNames[2]="Cheyenne"
RandomNickNames[3]="Chippewa"
RandomNickNames[4]="Choctaw"
RandomNickNames[5]="Comanche"
RandomNickNames[6]="Hopi"
RandomNickNames[7]="Kickapoo"
RandomNickNames[8]="Lakota"
RandomNickNames[9]="Mohawk"
RandomNickNames[10]="Navajo"
RandomNickNames[11]="Pawnee"
RandomNickNames[12]="Pueblo"
RandomNickNames[13]="Seminole"
RandomNickNames[14]="Shawnee"
RandomNickNames[15]="Sioux"
RandomNickNames[16]="Stabby"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Black Hawk"
RandomNickNames_Male[1]="Cochise"
RandomNickNames_Male[2]="Crazy Horse"
RandomNickNames_Male[3]="Geronimo"
RandomNickNames_Male[4]="Hiawatha"
RandomNickNames_Male[5]="Pontiac"
RandomNickNames_Male[6]="Red Cloud"
RandomNickNames_Male[7]="Sitting Bull"
RandomNickNames_Male[8]="Squanto"
RandomNickNames_Male[9]="Standing Bear"
RandomNickNames_Male[10]="Tatonka"
RandomNickNames_Male[11]="Tecumseh"
RandomNickNames_Female[0]="Pocahontas"
RandomNickNames_Female[1]="Sacajawea"

[Beags_Escalation_BattleScanner X2AbilityTemplate]
LocFriendlyName="Battle Scanner"
LocLongDescription="The Battle Scanner provides extra vision on the battlefield. Soldiers deploy it like a grenade, throwing it to a hidden area of the map that they want to reveal. Any hidden or disguised enemies will be revealed as well."
LocHelpText="The Battle Scanner provides extra vision on the battlefield. Soldiers deploy it like a grenade, throwing it to a hidden area of the map that they want to reveal. Any hidden or disguised enemies will be revealed as well."
LocFlyOverText="Battle Scanner"
LocPromotionPopupText="<Bullet/> Battle Scanners reveal an area hidden by the \"fog of war\" for multiple turns.\n<br/><Bullet/> Battle Scanners also reveal hidden or disguised enemies.<br/><Bullet/> 2 uses per mission."

[Beags_Escalation_Assassinate X2AbilityTemplate]
LocFriendlyName="Assassinate"
LocLongDescription="Your attacks will not break concealment if they kill their target."
LocHelpText="Your attacks will not break concealment if they kill their target."
LocFlyOverText="Assassinate"
LocPromotionPopupText="<Bullet/> Your attacks will not break concealment if they kill their target."

[Beags_Escalation_Awareness X2AbilityTemplate]
LocFriendlyName="Awareness"
LocLongDescription="The soldier pays close attention to their surroundings, detecting the presence of nearby enemies."
LocHelpText="The soldier pays close attention to their surroundings, detecting the presence of nearby enemies."
LocFlyOverText="Awareness"
LocPromotionPopupText="<Bullet/> Reveal the presence of nearby enemies.<br/><Bullet/> 10 tile radius.<br/>"

[Beags_Escalation_AwarenessPassive X2AbilityTemplate]
LocFriendlyName="Awareness"
LocLongDescription="The soldier listens very carefully, detecting the presence of nearby enemies."
LocHelpText="The soldier listens very carefully, detecting the presence of nearby enemies."
LocFlyOverText="Awareness"
LocPromotionPopupText="<Bullet/> Reveal the presence of nearby enemies.<br/><Bullet/> 10 tile radius.<br/>"

[Beags_Escalation_Ghost X2AbilityTemplate]
LocFriendlyName="Ghost"
LocLongDescription="Greatly reduces the Scout's detection radius by enemies while concealed."
LocHelpText="Greatly reduces the Scout's detection radius by enemies while concealed."
LocFlyOverText="Ghost"
LocPromotionPopupText="<Bullet/> Detection radius reduced by 50% whie concealed.<br/>"

[Beags_Escalation_Recon X2AbilityTemplate]
LocFriendlyName="Recon"
LocLongDescription="Gain +1 sight radius."
LocHelpText="Gain +1 sight radius."
LocFlyOverText="Recon"
LocPromotionPopupText="<Bullet/> +1 sight radius.<br/>"

[Beags_Escalation_Recon_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Scout SGT: Recon"
Summary="All soldiers are trained to be more observant of their surroundings.<br/><Bullet/> +1 sight radius.<br/>"

[Beags_Escalation_LowProfile X2AbilityTemplate]
LocFriendlyName="Low Profile"
LocLongDescription="Treat low cover as high cover."
LocHelpText="Treat low cover as high cover."
LocFlyOverText="Low Profile"
LocPromotionPopupText="<Bullet/> Treat low cover as high cover.<br/>"

[Beags_Escalation_LowProfile_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Scout: Low Profile"
Summary="No one goes to ground quite like the Scout.<br/><Bullet/> Treat low cover as high cover.<br/>"

;-------------------------------------------------------------------------------------------
; Rocketeer Abilities
;-------------------------------------------------------------------------------------------

[Beags_Escalation_Rocketeer X2SoldierClassTemplate]
DisplayName="Rocketeer"
ClassSummary="Rocketeers are heavy weapons units that support their team through the application of overwhelming heavy ordnance. The rockets they employ are an effective, if volatile, solution to the alien threat."
LeftAbilityTreeTitle="Tank Hunter"
RightAbilityTreeTitle="Rifleman AT"

RandomNickNames[0]="Archer"
RandomNickNames[1]="Arrow"
RandomNickNames[2]="Atom Bomb"
RandomNickNames[3]="Condor"
RandomNickNames[4]="Falcon"
RandomNickNames[5]="Four Eyes"
RandomNickNames[6]="Gazelle"
RandomNickNames[7]="Harpoon"
RandomNickNames[8]="Hellfire"
RandomNickNames[9]="Hornet"
RandomNickNames[10]="Hydrogen Bomb"
RandomNickNames[11]="Javelin"
RandomNickNames[12]="Jericho"
RandomNickNames[13]="Jupiter"
RandomNickNames[14]="Lance"
RandomNickNames[15]="Maverick"
RandomNickNames[16]="Minuteman"
RandomNickNames[17]="Nuclear"
RandomNickNames[18]="Patriot"
RandomNickNames[19]="Peacekeeper"
RandomNickNames[20]="Scud"
RandomNickNames[21]="Shrike"
RandomNickNames[22]="Sidewinder"
RandomNickNames[23]="Skybolt"
RandomNickNames[24]="Sparrow"
RandomNickNames[25]="Spartan"
RandomNickNames[26]="Thor"
RandomNickNames[27]="Tomahawk"
RandomNickNames[28]="Tident"

[Beags_Escalation_LaunchRocket X2AbilityTemplate]
LocFriendlyName="Launch Rocket"
LocLongDescription="The Rocketeer uses a rocket launcher to fire rockets. This allows for delivering large explosive payloads at greater range."
LocHelpText="Launches the loaded rocket at target area."
LocFlyOverText="Launch Rocket"
LocPromotionPopupText="<Bullet/> The range of launched rockets can be further improved by upgrading to more advanced rocket launchers.<br/>"

[Beags_Escalation_ExtraHERocket X2AbilityTemplate]
LocFriendlyName="High Explosive Rocket"
LocLongDescription="The Rocketeer packs one High Explosive Rocket as standard equipment."
LocHelpText="The Rocketeer packs one High Explosive Rocket as standard equipment."
LocFlyOverText="High Explosive Rocket"
LocPromotionPopupText="<Bullet/> +1 extra High Explosive Rocket per mission.<br/>"

[Beags_Escalation_HEATWarheads X2AbilityTemplate]
LocFriendlyName="HEAT Warheads"
LocLongDescription="Your rocket attacks have +3 armor penetration (+6 with Advanced Explosives)."
LocHelpText="Your rocket attacks have +3 armor penetration (+6 with Advanced Explosives)."
LocFlyOverText="HEAT Warheads"
LocPromotionPopupText="<Bullet/> +3 armor penetration with basic rockets.<br/><Bullet/> +6 armor penetration with advanced rockets.<br/>"

[Beags_Escalation_FireInTheHole X2AbilityTemplate]
LocFriendlyName="Fire in the Hole"
LocLongDescription="Grants +10 aim and +3 range for rockets if the soldier has not moved this turn."
LocHelpText="Grants +10 aim and +3 range for rockets if the soldier has not moved this turn."
LocFlyOverText="Fire in the Hole"
LocPromotionPopupText="<Bullet/> +10 aim for rockets if stationary.<br/><Bullet/> +10 range for rockets if stationary.<br/>"

[Beags_Escalation_ExtraShredderRocket X2AbilityTemplate]
LocFriendlyName="Shredder Rocket"
LocLongDescription="The Rocketeer packs one Shredder Rocket as standard equipment."
LocHelpText="The Rocketeer packs one High Explosive Rocket as standard equipment."
LocFlyOverText="Shredder Rocket"
LocPromotionPopupText="<Bullet/> +1 extra Shredder Rocket per mission.<br/>"

[Beags_Escalation_JavelinRockets X2AbilityTemplate]
LocFriendlyName="Javelin Rockets"
LocLongDescription="Your rockets now travel 33% further."
LocHelpText="Your rockets now travel 33% further."
LocFlyOverText="Javelin Rockets"
LocPromotionPopupText="<Bullet/> Your rockets now travel 33% further.<br/>"

[Beags_Escalation_LaunchBunkerBuster X2AbilityTemplate]
LocFriendlyName="Launch Bunker Buster"
LocLongDescription="Launch a high payload H.E. Rocket with an increased blast radius. The Bunker Buster breaks through obstacles in its path before exploding at the point of impact."
LocHelpText="Launches the loaded Bunker Buster rocket at target area."
LocFlyOverText="Launch Bunker Buster"
LocPromotionPopupText="<Bullet/> Penetrates through walls and other obstacles.<br/><Bullet/> Large impact radius.<br/><Bullet/> 1 charge per mission.<br/>"

[Beags_Escalation_ExtraBunkerBuster X2AbilityTemplate]
LocFriendlyName="Bunker Buster"
LocLongDescription="The Rocketeer packs one high payload Bunker Buster rocket as standard equipment."
LocHelpText="The Rocketeer packs one high payload Bunker Buster rocket as standard equipment."
LocFlyOverText="Bunker Buster"
LocPromotionPopupText="<Bullet/> Penetrates and damages walls, units and other obstacles.<br/><Bullet/> Large impact radius.<br/>"

[Beags_Escalation_RocketSnapshot X2AbilityTemplate]
LocFriendlyName="Snapshot"
LocLongDescription="Reduces the aim penalty for launching a rocket after taking a costly action."
LocHelpText="Reduces the aim penalty for launching a rocket after taking a costly action."
LocFlyOverText="Snapshot"
LocPromotionPopupText="<Bullet/> -50% to the aim penalty for launching a rocket after taking a costly action.<br/>"

[Beags_Escalation_RocketSnapshot_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Rocketeer: Snapshot"
Summary="Reduces the aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> -50% to the aim penalty for launching a rocket after taking a costly action.<br/>"

[Beags_Escalation_WeaponsTeam X2AbilityTemplate]
LocFriendlyName="Weapons Team"
LocLongDescription="As a single action that ends a soldier’s turn, assist an adjacent Rocketeer, reducing their aim penalty for launching a rocket after taking a costly action."
LocHelpText="As a single action that ends a soldier’s turn, assist an adjacent Rocketeer, reducing their aim penalty for launching a rocket after taking a costly action."
LocFlyOverText="Weapons Team"
LocPromotionPopupText="As a single action that ends a trooper’s turn, assist an adjacent Rocketeer, reducing their aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> Lasts until the end of the turn or until the Rocketeer moves.<br/><Bullet/> -50% to the target's aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> Costs 1 action point and ends your turn.<br/>"

[Beags_Escalation_WeaponsTeam_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Rocketeer SGT: Weapons Team"
Summary="All soldiers may assist adjacent Rocketeers in steadying and aiming their weapon, reducing their aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> Lasts until the end of the turn or until the Rocketeer moves.<br/><Bullet/> -50% to the target's aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> Costs 1 action point and ends your turn.<br/>"

;-------------------------------------------------------------------------------------------
; Gunner Abilities
;-------------------------------------------------------------------------------------------

[Beags_Escalation_Gunner X2SoldierClassTemplate]
DisplayName="Gunner"
ClassSummary="The Gunner uses guns."
LeftAbilityTreeTitle="Fire Support"
RightAbilityTreeTitle="Area Denial"

RandomNickNames[0]="Badger"
RandomNickNames[1]="Blazer"
RandomNickNames[2]="Bouncer"
RandomNickNames[3]="Boxer"
RandomNickNames[4]="Charger"
RandomNickNames[5]="Firefly"
RandomNickNames[6]="Grinder"
RandomNickNames[7]="Icarus"
RandomNickNames[8]="Mongoose"
RandomNickNames[9]="Osprey"
RandomNickNames[10]="Pelter"
RandomNickNames[11]="Piercer"
RandomNickNames[12]="Pincher"
RandomNickNames[13]="Rain Doctor"
RandomNickNames[14]="Rainmaker"
RandomNickNames[15]="Sentinel"
RandomNickNames[16]="Snapper"
RandomNickNames[17]="Spanker"
RandomNickNames[18]="Sparkler"
RandomNickNames[19]="Sparrowhawk"
RandomNickNames[20]="Spitfire"
RandomNickNames[21]="Tickler"

[Beags_Escalation_HMGMoved X2AbilityTemplate]
LocFriendlyName="Moved"
LocLongDescription="You moved, preventing you from firing your HMG."
LocHelpText="You moved, preventing you from firing your HMG."
LocFlyOverText="Moved"
LocPromotionPopupText="<Bullet/> You cannot fire your HMG.<br/>"

[Beags_Escalation_HMGOverwatch X2AbilityTemplate]
LocFriendlyName="Overwatch"
LocHelpText="Fire on the first enemy that moves within your line of sight, with a penalty to aim."
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight, but only if revealed."
LocFlyOverText="Overwatch"
LocFriendlyNameWhenConcealed="Overwatch (Concealed)"

[Beags_Escalation_ShredderAmmo X2AbilityTemplate]
LocFriendlyName="Shredder Ammo"
LocLongDescription="Applies +1/+2/+3 Rupture damage with your primary weapon targets based on weapon tech level."
LocHelpText="Applies +1/+2/+3 Rupture damage with your primary weapon targets based on weapon tech level."
LocFlyOverText="Shredder Ammo"
LocPromotionPopupText="<Bullet/> +1/+2/+3 Rupture damage with your primary weapon targets based on weapon tech level.<br/>"

[Beags_Escalation_CollateralDamage X2AbilityTemplate]
LocFriendlyName="Collateral Damage"
LocLongDescription="Area of effect attack that destroys most cover. 3 ammo."
LocHelpText="Area of effect attack that destroys most cover. 3 ammo."
LocFlyOverText="Collateral Damage"
LocPromotionPopupText="<Bullet/> Destroys most cover.<br/><Bullet/> Deals no damage to enemies.<br/><Bullet/> Costs 3 ammo.<br/>"

[Beags_Escalation_FireSuperiority X2AbilityTemplate]
LocFriendlyName="Fire Superiority"
LocLongDescription="While suppressing, you will take an additional reaction fire shot at your Suppression target if they perform an attack, and against enemies who attack a friendly unit within 3 tiles of you."
LocHelpText="While suppressing, you will take an additional reaction fire shot at your Suppression target if they perform an attack, and against enemies who attack a friendly unit within 3 tiles of you."
LocFlyOverText="Fire Superiority"
LocPromotionPopupText="<Bullet/> While suppressing, extra reaction fire shot against your Suppression target if they attack.<br/><Bullet/> While suppressing, extra reaction fire shot against enemies who attack allies within 3 tiles.<br/>"

[Beags_Escalation_IronCurtain X2AbilityTemplate]
LocFriendlyName="Iron Curtain"
LocLongDescription="Area of effect attack that deals very little damage but staggers targets, reducing their action points by 1 on their next turn. 3 ammo. 5 turn cooldown."
LocHelpText="Area of effect attack that deals very little damage but staggers targets, reducing their action points by 1 on their next turn. 3 ammo. 5 turn cooldown."
LocFlyOverText="Iron Curtain"
LocPromotionPopupText="<Bullet/> Staggers targets.<br/><Bullet/> Deals very little damage to enemies.<br/><Bullet/> Costs 3 ammo.<br/><Bullet/> 5 turn cooldown.<br/>"

[Beags_Escalation_SuppressingFire X2AbilityTemplate]
LocFriendlyName="Suppressing Fire"
LocLongDescription="Firing at or suppressing an enemy applies a -5 stacking aim penalty on them for 1 turn."
LocHelpText="Firing at or suppressing an enemy applies a -5 stacking aim penalty on them for 1 turn."
LocFlyOverText="Suppressing Fire"
LocPromotionPopupText="<Bullet/> Firing at or suppressing an enemy applies a -5 stacking aim penalty on them for 1 turn.<br/>"

[Beags_Escalation_SuppressingFire_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Gunner: Suppressing Fire"
Summary="Firing at or suppressing an enemy applies a -5 stacking aim penalty on them for 1 turn.<br/>"

[Beags_Escalation_Brace X2AbilityTemplate]
LocFriendlyName="Brace"
LocLongDescription="As a single action that ends a soldier’s turn, assist an adjacent Gunner, reloading their primary weapon and allowing them to fire an HMG after moving with a -10 aim penalty."
LocHelpText="As a single action that ends a soldier’s turn, assist an adjacent Gunner, reloading their primary weapon and allowing them to fire an HMG after moving with a -10 aim penalty."
LocFlyOverText="Brace"
LocPromotionPopupText="As a single action that ends a soldier’s turn, assist an adjacent Gunner, reloading their primary weapon and allowing them to fire an HMG after moving with a -10 aim penalty.<br/><Bullet/> Lasts until the end of the turn or until the Gunner moves.<br/><Bullet/> Costs 1 action point and ends your turn.<br/>"

[Beags_Escalation_Brace_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Gunner SGT: Brace"
Summary="All soldiers may assist adjacent Gunners in servicing and bracing their machinegun, reloading their primary weapon and allowing them to fire an HMG after moving with a -10 aim penalty.<br/><Bullet/> Lasts until the end of the turn or until the Gunner moves.<br/><Bullet/> Costs 1 action point and ends your turn.<br/>"


;-------------------------------------------------------------------------------------------
; Shredder Ability "Fake" Upgrades
;-------------------------------------------------------------------------------------------
[Beags_Escalation_ShredderUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Shredder Ammo"
FriendlyNamePlural="Basic Shredder Ammo"
BriefSummary="Adds 1 Rupture damage to attacks."
TinySummary="Adds Rupture damage."
LootTooltip="This weapon upgrade will add Rupture damage to any weapon it is attached to."

[Beags_Escalation_ShredderUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Shredder Ammo"
FriendlyNamePlural="Advanced Shredder Ammo"
BriefSummary="Adds 2 Rupture damage to attacks."
TinySummary="Adds Rupture damage."
LootTooltip="This weapon upgrade will add Rupture damage to any weapon it is attached to."

[Beags_Escalation_ShredderUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Shredder Ammo"
FriendlyNamePlural="Superior Shredder Ammo"
BriefSummary="Adds 3 Rupture damage to attacks."
TinySummary="Adds Rupture damage."
LootTooltip="This weapon upgrade will add Rupture damage to any weapon it is attached to."


;-------------------------------------------------------------------------------------------
; Heavy Machine Guns
;-------------------------------------------------------------------------------------------
[Beags_Escalation_HMG_CV X2WeaponTemplate]
FriendlyName="HMG"
FriendlyNamePlural="HMG"
BriefSummary="The HMG is an improvised heavy support weapon, specialized for high-caliber volume fire. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> Provides limited Squadsight of 8 tiles.\n<Bullet/> Cannot be fired after moving.\n<Bullet/> Use upgrades looted from enemies to improve the HMG's tactical effectiveness."
AbilityDescName="cannon"

[Beags_Escalation_HMG_MG X2WeaponTemplate]
FriendlyName="Mag HMG"
FriendlyNamePlural="Mag HMGs"
BriefSummary="Magnetic weapons tech will let us deploy a rapid-fire version of the HMG. Our Gunners will be able to lay down a much deadlier volume of fire."
TacticalText="<Bullet/> The Mag HMG is a much more powerful, yet equally deployable, version of the conventional HMG.\n<Bullet/> Cannot be fired after moving.\n<Bullet/> Provides limited Squadsight of 8 tiles.\n<Bullet/> Use upgrades looted from enemies to improve the Mag HMG's tactical effectiveness."
AbilityDescName="cannon"

[Beags_Escalation_HMG_BM X2WeaponTemplate]
FriendlyName="Beam HMG"
FriendlyNamePlural="Beam HMGs"
BriefSummary="Devising a more powerful, high-volume beam weapon for our Gunners required substantial effort, but the firepower it brings is unquestioned."
TacticalText="<Bullet/> The Beam HMG is the most powerful combat support weapon human forces can deploy.\n<Bullet/> Provides limited Squadsight of 8 tiles.\n<Bullet/> Provides limited Squadsight of 8 tiles.\n<Bullet/> Use upgrades looted from enemies to improve the Beam HMG's tactical effectiveness."
AbilityDescName="cannon"
